{
  "filename": "18o.txt",
  "content": "Online Group 2 Discussion 2 \\n\\nAastha Jatinkumar Patel (2234665) \\n\\nMaria Haseebuddin Mir (2232348) \\n\\nNamanpreet Jhatia (2319590) \\n\\nNamuun Purevbayar (2315169) \\n\\nVismaya Vijayan (2303749) \\n\\nUniversity Canada West \\n\\nCMPT 641: Digital Transformation (HBD-SUMMER24-17) \\n\\nProf. Amirhossein Zaji \\n\\nAugust 29, 2024 \\n\\nIntroduction\\n\\nThe manufacturing industry rapidly evolves due to technology differentiation (China, 2023). AI and ML stand at the center of this digital change, offering better solutions in operations, results, and worth (Loh, 2024). This report will, therefore, seek to establish and discuss the role artificial intelligence and machine learning play in the manufacturing industry.\\n\\nCritical Applications of AI and ML in Manufacturing\\n\\nPredictive Maintenance\\n\\n The most promising area of implementing AI in manufacturing is predictive maintenance. Machine history data can be fed into AI algorithms to identify if specific equipment is likely to fail shortly (HSO, n.d.). This allows for early detection and maintenance, thus reducing time spent and expensive repairs.\\n\\nQuality Control\\n\\nInnovative vision systems that include high-resolution and high-definition cameras can more precisely detect product defects (Metrology News, 2023). It is advantageous since it can locate defects that are usually difficult to see by the human eye, particularly when inspecting the final products during manufacturing (Hryniewicz,2024).\\n\\nProcess Optimization\\n\\nThrough the data gathered from production lines, sensors, or even ERP, the ML models can help identify the areas with the worst performance (IT Convergence,2022) and produce reports that could support solutions to eliminate the source of inefficiency (Zakaryan, 2022). Thus, by identifying such problem zones, ML can suggest changes in the processes focused on increasing productivity and the work and resource consumption rate.\\n\\nSupply Chain Management\\n\\nAnother benefit is that based on the pattern of past sales and other factors, organizations can forecast demand in the future more effectively with the help of AI (Downie & Finn, 2024). This helps businesses stock products in the correct quantity and eliminate overstocking or stocked-out products. Moreover, AI can analyze the transportation routes, monitor the shipment in real-time, and even determine the potential issues that disrupt the shipment (Oracle, 2023).\\n\\nRobotics and Automation\\n\\nAI ensures that manufacturing lines use robots for monotonous and risky assignments. Such robots can effectively and efficiently adjust and do most tasks that human beings can do but in a much faster and safer manner (ABB, 2023). Moreover, safe and proper interaction between humans and robots is possible through AI, which improves productivity (Lawton, 2020).\\n\\nProduct Design and Development\\n\\nAI can learn more about customers ' choices and trends using customer reviews, social media posts, and other market research data (Experience League, n.d.). AI is also helpful in modeling product performance under various scenarios of use to enhance designs and look for problems encountered in real-life situations (My3DExperience, n.d.).\\n\\nAdvantages of AI and ML in Manufacturing\\n\\nAI and ML increase effectiveness and reduce costs and time wastage by automating operations, improving overall productivity.\\nPredictive maintenance systems can eliminate material failures, and quality assurance can be achieved, thus reducing the number of defective products available in the market (HSO, n.d.).\\n In general, by increasing productivity or reducing the time that some operations take, AI and ML can contribute to cutting expenses (EY, n.d.).\\nAmplifying product development time, reducing it by achieving new product designs, and boosting the rate of innovations (WE Forum, 2024).\\nAI can give important insights and forecasts and back up relevant decisions (Mailchimp, n.d.).\\n Challenges:\\n\\nFrom the analysis results, the efficiency of AI and ML depends entirely on the quality and quantity of data (Reilly, 2024). Organizations do not compromise on the quality of the data, where accuracy and completeness are paramount.\\nThere are also costs to integrating AI and ML, such as tools, hardware, software, and necessary training (Peeler, 2023).\\nPossible ethical implications from AI's application in producing goods include loss of employment to machines and invasion of privacy.\\nAI systems can be hacked for different purposes, so powerful security tools should protect them.\\n Conclusion\\n\\n            AI and ML have taken the manufacturing industries to a new level, where efficiency is observed, quality is enhanced, and cost is eliminated (Loh, 2024). By applying these technologies, the manufacturers can create a competitive edge and prepare for future success. However, the solution is challenging because of factors like inadequate or low-quality data, the cost of implementing AI and ML solutions, and ethical issues crucial for manufacturing industries to defeat to unleash the full potential of AI and ML.\\n\\nReferences:\\n\\nABB. (2023, April 25). ABB’s AI-enabled Robotic Item Picker makes fulfillment faster and more efficient.\\n\\nhttps://new.abb.com/news/detail/102366/prsrl-abbs-ai-enabled-robotic-item-picker-makes-fulfilment-faster-and-more-efficient\\n\\nChina, C. (2023, June 29). 10 Manufacturing trends that are changing the industry. IBM.\\n\\n            https://www.ibm.com/think/insights/manufacturing-trends\\n\\nDownie, A. & Finn, T. (2024, May 20). What is AI in supply chain? IBM.\\n\\nhttps://www.ibm.com/think/topics/ai-supply-chain\\n\\nExperience League. (2023, March 26). Using Adobe Analytics machine learning and AI for the moments that matter.\\n\\nhttps://experienceleague.adobe.com/en/docs/analytics-learn/tutorials/data-science/using-machine-learning-and-ai-for-the-moments-that-matter\\n\\nEY (n.d.). How a manufacturer eliminates cost and value leakages with AI-ML.\\n\\nhttps://www.ey.com/en_in/insights/advanced-manufacturing/how-a-manufacturer-eliminates-cost-and-value-leakages-with-ai-ml\\n\\nHSO (n.d.). How AI in Manufacturing is Reshaping Maintenance Strategies to Minimise Downtime.\\n\\nhttps://www.hso.com/blog/how-ai-in-manufacturing-is-reshaping-maintenance-strategies-to-minimise-downtime\\n\\nHSO (n.d.). Enhancing Product Quality and Reliability with AI for Manufacturing Quality Control.\\n\\nhttps://www.hso.com/blog/enhancing-product-quality-and-reliability-with-ai-for-manufacturing-quality-control\\n\\nHryniewicz, R. (2024, April 22). AI Visual Inspection: Defect Detection in Manufacturing. Neurosys.\\n\\nhttps://neurosys.com/blog/ai-defect-detection-in-manufacturing\\n\\nIT Convergence. (2022, October 21). Real-World Use Cases of Data Integration in Manufacturing.\\n\\nhttps://www.itconvergence.com/blog/real-world-use-cases-of-data-integration-in-manufacturing/\\n\\nLawton, J. (2020, June 6). Artificial Intelligence (AI) and Robots: Not what you think. Universal Robots.\\n\\nhttps://www.universal-robots.com/blog/ai-and-robots-not-what-you-think/\\n\\nLoh, P. (2024, April 09). The Dawn of AI in Manufacturing: Understanding Its Wide-Reaching Impact on Industry. Foley.\\n\\nhttps://www.foley.com/insights/publications/2024/04/ai-manufacturing-impact-industry/\\n\\nMailchimp. (n.d.). How AI Predictions Drive Business Insights and Decision Making.\\n\\nhttps://mailchimp.com/resources/ai-predictions/\\n\\nMetrology News. (2023, November 13). A Closer Look at AI Machine Vision in Manufacturing.\\n\\nhttps://metrology.news/a-closer-look-at-ai-machine-vision-in-manufacturing/\\n\\nMy3DExperience. (n.d). https://my.3dexperience.3ds.com/welcome\\n\\nOracle. (2023, April 19). Oracle Introduces New AI and Automation Capabilities to Help Customers Optimize Supply Chain Management.\\n\\nhttps://www.oracle.com/news/announcement/oracle-introduces-new-ai-and-automation-capabilities-2023-04-19/\\n\\nPeeler, R. (2023, August 31). The Hidden Costs Of Implementing AI In Enterprise. Forbes.\\n\\nhttps://www.forbes.com/councils/forbestechcouncil/2023/08/31/the-hidden-costs-of-implementing-ai-in-enterprise/\\n\\nReilly, J. (2024, May 2). Cost of AI in 2024: Estimating Development & Deployment Expenses. Akkio.\\n\\nhttps://www.akkio.com/post/cost-of-ai\\n\\nWorld Economic Forum. (2024, January 4). 6 ways to unleash the power of AI in manufacturing.\\n\\nhttps://www.weforum.org/agenda/2024/01/how-we-can-unleash-the-power-of-ai-in-manufacturing/\\n\\nZakaryan, V. (2022, June 17). Bottleneck Analysis in Manufacturing: Tech Solution for Increasing Enterprise Productivity. PostIndustira.\\n\\n            https://postindustria.com/bottleneck-analysis-in-manufacturing-a-technological-solution-for-increasing-enterprise-productivity/\\n\\n"
}