{
  "filename": "27o.txt",
  "content": "\\n\\nTransforming RetroWoods\\n\\nIndividual Assignment 01\\n\\nRahman Sadakat (2202867)\\nUniversity Canada West\\nCMPT 641: Digital Transformation (Summer 2024-17)\\nDr. Amirhossein Zaji\\nAugust 11, 2024\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nIntroduction\\nRetroWoods was one of the most successful furniture outlets in Metro Vancouver since 2009. It has provided quality and decent-priced finished furniture to its corporate and individual customers. RetroWoods products include home and office furniture made with authentic woods sourced all around Canada and processed wood products. It offers finished and non-customized, full-built furniture to its customers. After the Novel coronavirus outbreak, RetroWoods has been facing business challenges due to its operational and limited-service issues, as it has a very conventional business model that has yet to have any touch of modern, data-driven, or even product delivery services to its buyers. The founder, Andy Johnson, wants to transform the technological department of RetroWoods digitally. Sadakat, a technical guru, has been hired to suggest and implement the changes. This study will showcase RetroWood's current value chain and develop a proposed value chain that will positively impact its business. The latter part will be about change management, how the human capital of the company might respond to technological changes, and a proposed change management model to revive their work spirit if otherwise. Lastly, this study will conclude with the overall impact of digital transformation, and the change management model might bring onto RetroWood's business.\\nBackground\\nRetroWoods uses a traditional business model, where customers purchase products only through visiting the store. However, it has a website that shares a product catalog, yet it does not add any additional value since online purchases and related services are unavailable on it. Offered products are finished or fully built large items, and customers need to carry them by means of transportation. It does not have a digital marketing channel for promotion, but it is known by its physical presence of a single outlet with warehouse facility located in Richmond, BC.\\nSadakat has proposed Andy to work with the digital transformation, where the team will develop AI and data-driven website and an app where customers can browse, price match, purchase, schedule deliveries, use the VR to compare and virtually place items at their houses. Customers can ask AI to provide customized interior design so that they can place modified furniture orders with suitable delivery options. The proposed transformation suggested installing a PLC production line, a smart POS system where the buying pattern of a customer will be provided with personalized purchasing options and targeted advertisements through a digital marketing solution where RetroWoods can generate more online sales via webpages and apps. Sadakat has also proposed to develop an e-learning system where staff will be coached about the transformation so that they can provide faster and better customer service. \\nRetroWoods Value Chain\\nThe value chain is referred to as a model that includes each step that a company goes through, from the concept of a product to its production and reaching the end user (Jenkins, 2022). In a nutshell, businesses search each step so that a missing value can be added that a customer wants to spend their money on. The vanilla value chain of RetroWoods has scope limitations to add value (as the case does not provide much information, this study will proceed through assumptions).\\nPrimary Activities\\nInbound logistics\\nInbound logistics include sourcing raw materials from suppliers and maintaining supplier relations. RetroWoods manages high-quality wood and related materials as inventories in its large warehouse in Richmond, BC. It also includes product stocking and down stocking.\\n \\n \\nOperations\\nFurniture production and store operations are two separate operational activities for RetroWoods. Production is based on manual labor, where everything is done and produced by craftsmen. Store operation is simply monitored and supervised by the store manager and sales are done through the salespeople.\\nOutbound Logistics\\nRetroWoods has only one outlet where the production and warehouse facility attached to it. The product distribution to the store is easy, once produced the labors just pull the product to the store for selling. Since the production unit and warehouse are in the same place, inventory management is nothing special. The supervisor uses an Excel sheet to manage all the produced and sold items.\\nMarketing & Sales\\nSince it has been running on a traditional business model, the concept of marketing is very narrow. The old store and the Goodwill built almost twenty years ago are the only marketing beacons. \\nService\\nRetroWoods does not provide any aftersales services to its clients, and the scope is limited. \\nSupport Activities\\nInfrastructure\\nThe company has a centralized decision-making process, where the director makes decisions and is implemented by the managers or supervisors. Once a brand of trust, RetroWood's goodwill is at stake as the competitors have already taken over its market.\\n  \\nHuman Resources Management\\nThe salary and wages are not aligned with the current market and there are hardly any career development options since the operations are flat and limited.\\nTechnology Department\\nRetroWoods does not have any technology department, as all the works are done manually. It only has a webpage that shows the store location and a product catalog. \\nProcurement\\nThe company procures raw materials from local sources that adhere to environmental laws and maintains a good relationship with the supplier. \\nFigure 1\\nRetroWoods current value chain model\\n Note. Value chain of RetroWoods, developed by the author based on assumptions \\nProposed Value Chain\\nPrimary Activities\\nInbound Logistics\\nAccording to the previous value chain, RetroWoods' inbound logistics seems acceptable and may remain unchanged.\\nOperations\\nProposed operations are divided into two parts, production and store. PLC assembly line will be installed to produce furniture in an automated assembly line. It will increase production rates and reduce waste. Smart store layouts will navigate customers to the right aisle for the right product without the help of salespeople. These will reduce labor costs as the company will have fewer laborers to manage.\\nOutbound Logistics\\nThe production floor, warehouse, and outlet are in the same place. Distribution and product replenishment can be maintained without any additional issues. RetroWoods needs to purchase two delivery trucks to deliver customer orders once the transformation takes place.\\nMarketing and Sales\\nA new webpage and an app will be developed to increase customer interaction. Integration of an e-commerce platform will allow customers to purchase online. The proposed webpage and app will be data-driven and AI-based, where customers can browse, price match, purchase, schedule deliveries, and use the VR to compare, and virtually place items at their houses. Customers can ask AI to provide customized interior design so that they can place modified furniture orders with suitable delivery options. The purchase habits of customers will allow the digital marketing solution to show targeted ads. Also, social media advertising and search engine optimization (SEO) will provide RetroWoods to reach a broader audience effectively. Implementing data-driven performance tracking will fine-tune campaigns and strategies in real-time.\\nServices\\nE-learning will coach staff on how to create a welcoming environment for the customers in the store. Also, developing a call center will increase customer interactions. A new return policy for unused items will allow customers to exchange and re-purchase items as per needs. \\nSupport Activities\\nInfrastructure\\nDeveloping a de-centralized decision making will make operations smoother. Managers and supervisors can make business decisions on demand. Developing and integrating new business models through digital transformation will positively impact brand image. \\nHuman Resources Department\\nThe digital transformation will reduce the number of workers since the production will be transformed into PLC systems. However, potential candidates can be moved to admin and salesforce jobs. This will create ample opportunities for the employees to excel in their careers. RetroWoods needs to adjust the pay scale accordingly with the current standard to attract potential people from the labor market. Also, HRD needs to arrange training sessions to improve the skills of the staff.\\nTechnology Department\\nImplementation of the proposed transformation will be the key task of the technology department. Inventory optimization, smart store layout, AI and data-driven webpage and app with VR integration, and smart POS installation will be the key activities of the technology department. \\nProcurement\\nNo change is required for this activity.\\n\\n\\n\\nFigure 2\\nProposed value chain of RetroWoods\\n \\nNote. Proposed value chain developed by the author for RetroWoods\\nChange Management\\nChange management is the execution of a structured process, leading human capital to accomplish as anticipated (Creasey, 2022). Implementation of digital transformation will bring changes in responsibilities, job types, work processes, or even job cuts. There are ample chances employees resist changes.\\nKotter’s 8 Steps Change Model\\nModel, named after John Kotter, focuses on people's side to stimulate their psychology through a series of 8 steps (Hicks, 2022). This study has selected Kotter’s Change Model because it is more suitable for embarking on significant organizational changes and digital transformations (Hicks, 2022).\\n\\n\\n\\n\\nChange Management Model Described\\nFigure 3\\nKotter’s 8 Step Change Model\\n\\n \\nNote. Author’s idea about the proposed change model to initiate change\\nConclusion\\nImplementing the digital transformation based on data and AI driven solutions will create opportunities for RetroWoods to sustain in the long run. Smart webpage and mobile app will be a game changer along with the VR integration. E-commerce platforms, digital marketing solutions, and SEO will increase sales. Optimized inventory and store layout will increase operational efficiency and customer satisfaction. However, the change in the process and PLC-based production unit will have significant job cuts and employee dissatisfaction. However, it will create ample chances for potential staff to excel in their growth through e-learning skill development. The potential fear of changes among people can be worked out by developing and practicing a proven method of Kotter’s 8-Step Change Model.\\nReferences\\nCreasey, T. (2022, May 18). Definition of Change Management. Www.prosci.com. https://www.prosci.com/blog/definition-of-change-management\\n\\n Hicks, K. (2022, May 2). Organizational change management: 8 proven models to navigate change. Zendesk. https://www.zendesk.com/blog/change-management-models/\\n\\nJenkins, A. (2022, December 21). What Is Value Chain? An Expert Guide? Oracle NetSuite. https://www.netsuite.com/portal/resource/articles/erp/value-chain.shtml\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n‌ \\n\\n\\n\\n\\n\\n\\n\\n\\n"
}